# FootSingleQuote Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..FootSingleQuote Property
SymbolTypeId Class See Also
---
Symbol ', indicating unit Feet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId FootSingleQuote { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FootSingleQuote As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FootSingleQuote {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace